## pandas

import pandas as pd
import numpy as np

In [ ]:
import pandas as pd

print(pd.__version__)

In [ ]:
pd_data=pd.read_csv("weather1week.csv")
pd_data

In [ ]:
pd_data=pd.read_csv("weather1week.csv",names=["year","month","day","hour","minute","temp"],delimiter=";")
pd_data

In [ ]:
pd_data.year

In [ ]:
pd_data.month

In [ ]:
pd_data=pd.read_csv("weather1week.csv",usecols=[0,1,4],name=["year","month"])
pd_data.head()

In [ ]:
pd_data.shape

In [ ]:
pd_data.dtypes

In [ ]:
# series

column=pd_data["year"]
column

In [ ]:
type(column)

In [14]:
s=pd.Series([0,1,4,9,16,25],name="squares")
s

0     0
1     1
2     4
3     9
4    16
5    25
Name: squares, dtype: int64

In [ ]:
s.values

In [ ]:
s.index

In [ ]:
s[2]

In [ ]:
s[1:4]

In [ ]:
#creating a series object

#computer language popularity in 2017

In [9]:
pop2017=pd.Series([100,99.7,99.5,97.1,87.7,87.7,85.6,81.2,75.1,73.7],index=["python","c","java","c++","c#","javaScript","php","go","swift","R"])
pop2017

python        100.0
c              99.7
java           99.5
c++            97.1
c#             87.7
javaScript     87.7
php            85.6
go             81.2
swift          75.1
R              73.7
dtype: float64

In [10]:
pop2017=pd.Series({"python":100,"c":99.7,"java":99.9})
pop2017

python    100.0
c          99.7
java       99.9
dtype: float64

In [11]:
pop2017.index

Index(['python', 'c', 'java'], dtype='object')

In [12]:
pop2017[1]

99.7

In [ ]:
pop2017["java"]

In [ ]:
pop2017["python":"java"]

In [ ]:
pop2017.iloc[0:2]

In [ ]:
pop2017.loc[:"java"]

In [13]:
pop2017[pop2017>90]

python    100.0
c          99.7
java       99.9
dtype: float64

In [8]:
#Arithmetic operations

srs1=pd.Series([1,9,-4,3,3])
srs2=pd.Series([2,3,4,5,10],index=[0,1,2,3,5])

In [ ]:
srs1,srs2

In [ ]:
srs1+srs2

In [ ]:
srs1**srs2

In [ ]:
srs1>srs2

In [ ]:
np.sqrt(srs2)

In [ ]:
np.abs(srs1)

In [ ]:
#some useful fuctions

srs1

In [ ]:
srs1.mean(),srs1.median()

In [ ]:
srs1.mode()

In [ ]:
srs1.min(),srs1.max(),srs1.std()

In [6]:
srs1

NameError: name 'srs1' is not defined

In [5]:
#creating a data frame

mat=np.arange(0,9).reshape(3,3)
mat

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [7]:
pd.DataFrame(mat)

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [4]:
arr=[(1,"a"),(2,"b"),(3,"c")]
pd.DataFrame(arr,columns=["letter","number"])

   letter number
0       1      a
1       2      b
2       3      c

In [ ]:
dictDF={"number":[1,2,3],"letters":["a","b","c"]}
pd.DataFrame(dictDF)

In [ ]:
ser1=pd.Series([24,30,10,42,65,52],name="age")
ser2=pd.Series(["ram","raj","ash","rahim"],name="name")
pd.DataFrame({"age":ser1,"name":ser2})

In [ ]:
pd.DataFrame([ser1,ser2])

In [ ]:
details=pd.DataFrame([ser1,ser2]).T
details

In [ ]:
details.to_csv("age1.csv")

In [ ]:
#create a dataframe of 10 even number-c-use list
#create a 5 movie with 4 column -movie name,male,female,rating(-1,0,1)
#create a multiplication table (data frame)of at least 4 number using Series object

In [ ]:
details.sort_values("name")

In [2]:
#create a dataframe of 10 even number-c-use list
import numpy as np
import pandas as pd

ser1=pd.Series([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20],name="empid")
ser2=pd.Series(["raj","velu","ravi","raju","ram","kumar","balu","rahul","balaji","aravind"],name="name")
pd.DataFrame({"empid":ser1,"name":ser2})

    empid     name
0       1      raj
1       2     velu
2       3     ravi
3       4     raju
4       5      ram
5       6    kumar
6       7     balu
7       8    rahul
8       9   balaji
9      10  aravind
10     11      NaN
11     12      NaN
12     13      NaN
13     14      NaN
14     15      NaN
15     16      NaN
16     17      NaN
17     18      NaN
18     19      NaN
19     20      NaN

In [3]:
ser1=pd.Series([2,4,6,8,10,12,14,16,18,20],name="empid")
ser2=pd.Series(["raj","velu","ravi","raju","ram","kumar","balu","rahul","balaji","aravind"],name="name")
pd.DataFrame({"empid":ser1,"name":ser2})

   empid     name
0      2      raj
1      4     velu
2      6     ravi
3      8     raju
4     10      ram
5     12    kumar
6     14     balu
7     16    rahul
8     18   balaji
9     20  aravind

In [30]:
#create a 5 movie with 4 column -movie name,male,female,rating(-1,0,1)
ser1=pd.Series(["BILLA","VISWASAM","MANGATHA","DHOOL"],name="MOVIE")
ser2=pd.Series(["AJITH","AJITH","AJITH","VIKRAM"],name="HERO")
ser3=pd.Series(["NAYANTHARA","NAYANTHARA","TRISHA","JYOTHIKA"],name="HEROINE")
ser4=pd.Series(["1","1","1","1"],name="RATING")
pd.DataFrame({"MOVIE":ser1,"HERO":ser2,"HEROINE":ser3,"RATING":ser4})

      MOVIE    HERO     HEROINE RATING
0     BILLA   AJITH  NAYANTHARA      1
1  VISWASAM   AJITH  NAYANTHARA      1
2  MANGATHA   AJITH      TRISHA      1
3     DHOOL  VIKRAM    JYOTHIKA      1

In [63]:
#create a multiplication table (data frame)of at least 4 number using Series object

ser1=pd.Series([1,2,3,4,5,6,7,8,9,10],name="1")
ser4=pd.Series(["*","*","*","*","*","*","*","*","*","*"],name="4")
ser2=pd.Series([2,2,2,2,2,2,2,2,2,2],name="2")
ser5=pd.Series(["=","=","=","=","=","=","=","=","=","="],name="5")
ser3=pd.Series((ser1*ser2),name="3")
pd.DataFrame({"1":ser1,"4":ser4,"2":ser2,"5":ser5,"3":ser3})

    1  4  2  5   3
0   1  *  2  =   2
1   2  *  2  =   4
2   3  *  2  =   6
3   4  *  2  =   8
4   5  *  2  =  10
5   6  *  2  =  12
6   7  *  2  =  14
7   8  *  2  =  16
8   9  *  2  =  18
9  10  *  2  =  20

In [64]:
ser1=pd.Series([1,2,3,4,5,6,7,8,9,10],name="1")
ser4=pd.Series(["*","*","*","*","*","*","*","*","*","*"],name="4")
ser2=pd.Series([3,3,3,3,3,3,3,3,3,3],name="2")
ser5=pd.Series(["=","=","=","=","=","=","=","=","=","="],name="5")
ser3=pd.Series((ser1*ser2),name="3")
pd.DataFrame({"1":ser1,"4":ser4,"2":ser2,"5":ser5,"3":ser3})

    1  4  2  5   3
0   1  *  3  =   3
1   2  *  3  =   6
2   3  *  3  =   9
3   4  *  3  =  12
4   5  *  3  =  15
5   6  *  3  =  18
6   7  *  3  =  21
7   8  *  3  =  24
8   9  *  3  =  27
9  10  *  3  =  30

In [4]:
details.sort_values('name')

NameError: name 'details' is not defined

In [ ]:
details.sort_values

In [5]:
data.head()

NameError: name 'data' is not defined